//==============================================================================================================================================
//
// ボスエリアに関する処理のヘッダーファイル
// Author : Atsumu Kuboichi
//
//==============================================================================================================================================
#ifndef _BOSSAREA_H_ //このマクロ定義がされなかったら
#define _BOSSAREA_H_ //2重インクルード防止のマクロ定義

//===========================================================================================================
// ヘッダーインクルード
//===========================================================================================================
#include "area.h"

//===========================================================================================================
// クラス定義
//===========================================================================================================
class CBossArea : public CArea
{
public:
	//======================================
	// 関数
	//======================================
	CBossArea();//コンストラクタ
	~CBossArea() override;//デストラクタ
	HRESULT Init() override;//初期化処理
	void Uninit() override;//終了処理
	void Release() override;//解放処理
	void Update() override;//更新処理
	void Draw() override;//描画処理
	bool Collision(D3DXVECTOR3 pos) override;//当たり判定

private:
	//======================================
	// 定数
	//======================================
	const float CAMERA_MIN_DISTANCE = 650.0f;//カメラ距離最小値
	const float CAMERA_MAX_DISTANCE = 1000.0f;//カメラ距離最大値
};

#endif
