////==============================================================================================================================================
////
//// エフェクトマネージャーに関する処理のヘッダーファイル
//// Author : Atsumu Kuboichi
////
////==============================================================================================================================================
//#ifndef _EFFECTMANAGER_H_ //このマクロ定義がされなかったら
//#define _EFFECTMANAGER_H_ //2重インクルード防止のマクロ定義
//
////===========================================================================================================
//// ヘッダーインクルード
////===========================================================================================================
//#include "objectmanager.h"
//#include <EffekseerForDXLib_170e_324b/VC/EffekseerForDXLib.h>
//
////===========================================================================================================
//// クラス定義
////===========================================================================================================
//class CEffectManager : public CObjectManager
//{
//public:
//	//======================================
//	// 関数
//	//======================================
//	CEffectManager();//コンストラクタ
//	~CEffectManager() override;//デストラクタ
//	HRESULT Init() override;//初期化処理
//	void Uninit() override;//終了処理
//	void Update() override;//更新処理
//	void Draw() override;//描画処理
//	void Load() override;//読み込み処理
//
//private:
//	//======================================
//	// 定数
//	//======================================
//	const int	EffectParticleLimit = 20000;//画面に表示できる最大パーティクル数
//	const int	EffectPlayInterval = 300;//エフェクトを再生する周期
//	const float EffectSize = 1.0f;//エフェクトのサイズ
//	const float	EffectMoveSpeed = 0.2f;//エフェクトが移動する速度
//	const char* EffectFilePath = "data/Laser01.efkefc";//エフェクトのファイルパス
//
//	//======================================
//	// 変数
//	//======================================
//	int m_nEffectResourceHandle;//エフェクトのリソース用
//	int m_nPlayingEffectHandle;//再生中のエフェクトハンドル
//	int	m_nPlayCount;//周期敵に再生するためのカウント
//};
//
//#endif
